kAMDSuccess = "Không xảy ra lỗi.";
kAMDUndefinedError = "Đã xảy ra lỗi không xác định.";
kAMDBadHeaderError = "Không thể truyền tệp.";
kAMDNoResourcesError = "Không thể phân bổ tài nguyên.";
kAMDReadError = "Không thể đọc từ thiết bị.";
kAMDWriteError = "Không thể ghi lên thiết bị.";
kAMDUnknownPacketError = "Gói không xác định.";
kAMDInvalidArgumentError = "Đối số không hợp lệ.";
kAMDNotFoundError = "Không thể tìm thấy tệp.";
kAMDIsDirectoryError = "Đường dẫn là một thư mục.";
kAMDPermissionError = "Bạn không có quyền.";
kAMDNotConnectedError = "Không kết nối với thiết bị.";
kAMDTimeOutError = "Thao tác hết thời gian chờ.";
kAMDOverrunError = "Tràn dữ liệu trên bộ đệm.";
kAMDEOFError = "Cuối tệp.";
kAMDUnsupportedError = "Không hỗ trợ thao tác này.";
kAMDFileExistsError = "Tệp đã tồn tại.";
kAMDBusyError = "Thiết bị đang bận.";
kAMDCryptoError = "Không thể thiết lập kết nối an toàn tới thiết bị.";
kAMDTooBigError = "Thư quá lớn.";
kAMDInvalidResponseError = "Đã nhận phản hồi không mong đợi từ thiết bị.";
kAMDMissingKeyError = "Khóa bị thiếu.";
kAMDMissingValueError = "Giá trị bị thiếu.";
kAMDGetProhibitedError = "Không thể truy xuất giá trị từ thiết bị đã khóa bằng mật khẩu.";
kAMDSetProhibitedError = "Không thể đặt giá trị trên thiết bị.";
kAMDRemoveProhibitedError = "Không thể xóa giá trị trên thiết bị.";
kAMDImmutableValueError = "Không thể thay đổi giá trị này.";
kAMDPasswordProtectedError = "Thiết bị được bảo vệ bằng mật khẩu.";
kAMDMissingHostIDError = "Thiết bị không nhận ra máy chủ này.";
kAMDInvalidHostIDError = "Thiết bị không nhận ra máy chủ này.";
kAMDSessionActiveError = "Phiên đang hoạt động.";
kAMDSessionInactiveError = "Phiên không hoạt động.";
kAMDMissingSessionIDError = "ID phiên bị thiếu.";
kAMDInvalidSessionIDError = "ID phiên không hợp lệ.";
kAMDMissingServiceError = "Dịch vụ bị thiếu.";
kAMDInvalidServiceError = "Dịch vụ không hợp lệ.";
kAMDServiceLimitError = "Quá nhiều bản ứng dụng của dịch vụ này đang chạy.";
kAMDCheckinSetupFailedError = "Không thể khởi động dịch vụ trên thiết bị";
kAMDInvalidCheckinError = "Không thể khởi động dịch vụ trên thiết bị";
kAMDCheckinTimeoutError = "Dịch vụ không khởi động đúng cách trên thiết bị.";
kAMDCheckinConnectionFailedError = "Dịch vụ không khởi động đúng cách trên thiết bị.";
kAMDCheckinReceiveFailedError = "Dịch vụ không khởi động đúng cách trên thiết bị.";
kAMDCheckinResponseFailedError = "Dịch vụ không khởi động đúng cách trên thiết bị.";
kAMDCheckinOutOfMemoryError = "Dịch vụ không khởi động đúng cách trên thiết bị.";
kAMDCheckinSendFailedError = "Dịch vụ không khởi động đúng cách trên thiết bị.";
kAMDMissingPairRecordError = "Máy chủ không được ghép đôi với thiết bị.";
kAMDInvalidPairRecordError = "Máy chủ không còn được ghép đôi với thiết bị.";
kAMDSavePairRecordFailedError = "Không thể lưu bản ghi ghép đôi.";
kAMDInvalidActivationRecordError = "Bản ghi kích hoạt không hợp lệ.";
kAMDMissingActivationRecordError = "Không thể tìm thấy bản ghi kích hoạt.";
kAMDServiceProhibitedError = "Không thể khởi động dịch vụ trên thiết bị.";
kAMDEscrowLockedError = "Thiết bị không khả dụng cho đến lần mở khóa đầu tiên sau khi khởi động.";
kAMDProhibitedBySupervision = "Thao tác bị cấm trên thiết bị được giám sát.";
kAMDPairingProhibitedError = "Chỉ cho phép ghép đôi qua USB.";
kAMDWrongDroidError = "Thiết bị đang ở chế độ khôi phục.";
kAMDSUVerificationError = "Không thể xác minh gói cập nhật phần mềm.";
kAMDSUPatchError = "Không thể vá tệp.";
kAMDSUFirmwareError = "Không thể gửi nhanh vi chương trình.";
kAMDProvisioningProfileNotValid = "Cấu hình cung cấp không hợp lệ.";
kAMDSendMessageError = "Không thể gửi thư tới thiết bị.";
kAMDReceiveMessageError = "Không thể nhận thông báo từ thiết bị.";
kAMDMissingOptionsError = "Tùy chọn bị thiếu.";
kAMDMissingImageTypeError = "Hình ảnh bị thiếu.";
kAMDDigestFailedError = "Không thể đọc ảnh trên đĩa.";
kAMDStartServiceError = "Không thể khởi động dịch vụ.";
kAMDInvalidDiskImageError = "Ảnh trên đĩa không hợp lệ.";
kAMDMissingDigestError = "Tài liệu bị thiếu.";
kAMDMuxError = "Đã xảy ra lỗi với bộ đa công của thiết bị USB.";
kAMDApplicationAlreadyInstalledError = "Ứng dụng hệ thống với mã nhận dạng gói cho trước đã được cài đặt trên thiết bị và không thể thay thế.";
kAMDApplicationMoveFailedError = "Không thể di chuyển ứng dụng đến đúng vị trí trên thiết bị.";
//kAMDApplicationSINFCaptureFailedError = "";
kAMDApplicationSandboxFailedError = "Không thể chạy ứng dụng trong môi trường ảo.";
kAMDApplicationVerificationFailedError = "Không thể xác minh ứng dụng.";
kAMDArchiveDestructionFailedError = "Không thể xóa lưu trữ ứng dụng.";
kAMDBundleVerificationFailedError = "Không thể xác minh gói nhà cung cấp.";
kAMDCarrierBundleCopyFailedError = "Không thể cài đặt gói nhà cung cấp.";
kAMDCarrierBundleDirectoryCreationFailedError = "Không thể tạo thư mục gói nhà cung cấp.";
kAMDCarrierBundleMissingSupportedSIMsError = "Không có SIM được hỗ trợ cho gói nhà cung cấp này.";
kAMDCommCenterNotificationFailedError = "Không thể nghe thông báo từ dải tần cơ sở.";
kAMDContainerCreationFailedError = "Không thể tạo bộ chứa ứng dụng.";
kAMDContainerP0wnFailedError = "Không thể sửa quyền trên bộ chứa ứng dụng.";
kAMDContainerRemovalFailedError = "Không thể xóa bộ chứa ứng dụng.";
kAMDEmbeddedProfileInstallFailedError = "Không thể cài đặt cấu hình cung cấp đã nhúng.";
kAMDErrorError = "Đã xảy ra lỗi.";
kAMDExecutableTwiddleFailedError = "Không thể thay đổi quyền có thể thực thi trên ứng dụng.";
kAMDExistenceCheckFailedError = "Không thể kiểm tra để xem liệu ứng dụng đã tồn tại chưa.";
kAMDInstallMapUpdateFailedError = "Không thể cập nhật danh sách ứng dụng đã cài đặt.";
kAMDManifestCaptureFailedError = "Không thể lưu bản kê khai ứng dụng.";
kAMDMapGenerationFailedError = "Không thể tạo bản đồ.";
kAMDMissingBundleExecutableError = "Gói ứng dụng không chứa tệp hiện hành.";
kAMDMissingBundleIdentifierError = "Gói ứng dụng không chứa định danh hợp lệ.";
kAMDMissingBundlePathError = "Không thể xác định đường dẫn gói ứng dụng.";
kAMDMissingContainerError = "Không thể tìm thấy bộ chứa cho ứng dụng đã cài đặt.";
kAMDNotificationFailedError = "Không thể đăng thông báo.";
kAMDPackageExtractionFailedError = "Không thể mở gói ứng dụng.";
kAMDPackageInspectionFailedError = "Không thể kiểm tra gói ứng dụng.";
kAMDPackageMoveFailedError = "Không thể di chuyển gói ứng dụng vào vị trí trung gian.";
kAMDPathConversionFailedError = "Không thể chuyển đổi đường dẫn.";
kAMDRestoreContainerFailedError = "Không thể phục hồi bộ chứa ứng dụng.";
kAMDSeatbeltProfileRemovalFailedError = "Không thể xóa cấu hình đai an toàn của ứng dụng.";
kAMDStageCreationFailedError = "Không thể tạo thư mục trung gian.";
kAMDSymlinkFailedError = "Không thể tạo liên kết biểu tượng.";
kAMDiTunesArtworkCaptureFailedError = "Không thể lưu ảnh nghệ thuật trên iTunes.";
kAMDiTunesMetadataCaptureFailedError = "Không thể lưu siêu dữ liệu trên iTunes.";
kAMDAlreadyArchivedError = "Ứng dụng đã được lưu trữ.";
kAMDUnknownCommandError = "Thiết bị không nhận ra lệnh.";
kAMDAPIInternalError = "Đã xảy ra lỗi API nội bộ.";
kAMDMuxCreateListenerError = "Không thể nghe với thiết bị USB.";
kAMDMuxGetListenerError = "Không thể nhận bộ nghe USB.";
kAMDMuxConnectError = "Không thể kết nối tới thiết bị.";
kAMDDeviceTooNewError = "Cần cập nhật ứng dụng này.";
kAMDDeviceRefNoGood = "Thiết bị này không được kết nối nữa.";
kAMDDeviceDisconnectedError = "Thiết bị này không được kết nối nữa.";
kAMDCannotTranslateError = "Không thể dịch tin nhắn từ thiết bị";
kAMDMobileImageMounterMissingImageSignature = "Không thể hỗ trợ phát triển.";
kAMDMobileImageMounterResponseCreationFailed = "Không thể hỗ trợ phát triển.";
kAMDMobileImageMounterMissingImageType = "Không thể hỗ trợ phát triển.";
kAMDMobileImageMounterMissingImagePath = "Không thể hỗ trợ phát triển.";
kAMDMobileImageMounterImageMapLoadFailed = "Không thể hỗ trợ phát triển.";
kAMDMobileImageMounterAlreadyMounted = "Không thể hỗ trợ phát triển.";
kAMDMobileImageMounterImageMoveFailed = "Không thể hỗ trợ phát triển.";
kAMDMobileImageMounterMountPathMissing = "Không thể hỗ trợ phát triển.";
kAMDMobileImageMounterMountPathNotEmpty = "Không thể hỗ trợ phát triển.";
kAMDMobileImageMounterImageMountFailed = "Không thể hỗ trợ phát triển.";
kAMDMobileImageMounterTrustCacheLoadFailed = "Không thể hỗ trợ phát triển.";
kAMDMobileImageMounterDigestFailed = "Không thể hỗ trợ phát triển.";
kAMDMobileImageMounterDigestCreationFailed = "Không thể hỗ trợ phát triển.";
kAMDMobileImageMounterImageVerificationFailed = "Không thể hỗ trợ phát triển.";
kAMDMobileImageMounterImageInfoCreationFailed = "Không thể hỗ trợ phát triển.";
kAMDMobileImageMounterImageMapStoreFailed = "Không thể hỗ trợ phát triển.";
kAMDDeviceOSVersionTooLow = "Phiên bản OS của thiết bị quá thấp.";
kAMDNoWifiSyncSupportError = "Thiết bị không hỗ trợ đồng bộ hóa không dây.";
kAMDDeviceFamilyNotSupported = "Ứng dụng này không hỗ trợ loại thiết bị này.";
kAMDPackagePatchFailedError = "Không thể áp dụng bản vá cập nhật cho ứng dụng.";
kAMDIncorrectArchitectureError = "Ứng dụng này không hỗ trợ loại CPU của thiết bị này.";
kAMDPluginCopyFailedError = "Không thể sao chép Trình cắm VPN vào bộ chứa ứng dụng.";
kAMDBreadcrumbFailedError = "Không thể ghi lộ trình cài đặt.";
kAMDBreadcrumbUnlockError = "Không thể cập nhật lộ trình cài đặt.";
kAMDGeoJSONCaptureFailedError = "Không thể lưu dữ liệu GeoJSON.";
kAMDNewsstandArtworkCaptureFailedError = "Không thể lưu hình minh họa Quầy báo.";
kAMDMissingCommandError = "Yêu cầu đã không chứa lệnh.";
kAMDNotEntitledError = "Ứng dụng đang yêu cầu không được phép thực hiện yêu cầu này.";
kAMDMissingPackagePathError = "Yêu cầu đã bị thiếu đường dẫn gói.";
kAMDMissingContainerPathError = "Yêu cầu đã bị thiếu đường dẫn bộ chứa.";
kAMDMissingApplicationIdentifierError = "Yêu cầu đã bị thiếu nhận dạng ứng dụng.";
kAMDMissingAttributeValueError = "Yêu cầu đã bị thiếu giá trị bắt buộc.";
kAMDLookupFailedError = "Không thể liệt kê các ứng dụng đã cài đặt.";
kAMDDictCreationFailedError = "Không thể trích xuất các khả năng từ yêu cầu.";

/* kMISFileError */
"A file operation failed." = "Tệp không hoạt động được.";

/* kMISModifiedResourcesError */
"A signed resource has been added, modified, or deleted." = "Tài nguyên xác thực đã được thêm, sửa hoặc xóa.";

/* kMISInvalidSignerError */
"A valid provisioning profile for this executable was not found." = "Không tìm thấy cấu hình cung cấp hợp lệ cho tệp hiện hành.";

/* kMISUnknownError */
"An unknown error has occurred." = "Đã xảy ra lỗi không xác định.";

/* kMISNotMutableError */
"Attempted to modify an immutable provisioning profile." = "Cố gắng sửa cấu hình cung cấp không thể thay đổi.";

/* kMISApplicationSignatureNotValidError */
"The application does not have a valid signature." = "Ứng dụng không có chữ ký hợp lệ.";

/* kMISApplicationSignatureNotValidError */
"The application's signature is valid but it does not match the expected hash." = "Chữ ký của ứng dụng hợp lệ nhưng không khớp với băm mong đợi.";

/* kMISAdHocSignatureError */
"The executable contains an invalid signature." = "Tệp hiện hành có chữ ký không hợp lệ.";

/* kMISInvalidEntitlementError */
"The executable was signed with invalid entitlements." = "Tệp hiện hành được ký với quyền không hợp lệ.";

/* kMISInvalidSignerCertError */
"The identity used to sign the executable is no longer valid." = "Nhận dạng dùng để ký tệp hiện hành không còn hợp lệ.";

/* kMISSignatureNotValidError */
"The signature was not valid." = "Chữ ký không hợp lệ.";

/* kMISConnectionClosedError */
"There was an error communicating with your device." = "Đã xảy ra lỗi khi liên lạc với thiết bị của bạn.";

/* kMISUnsupportedDeviceError */
"This provisioning profile cannot be installed on this device." = "Không thể cài đặt cấu hình cung cấp trên thiết bị này.";

/* kMISProfileSignatureNotValidError */
"This provisioning profile does not have a valid signature (or it has a valid, but untrusted signature)." = "Cấu hình cung cấp không có chữ ký hợp lệ (hoặc chữ ký hợp lệ nhưng không tin cậy).";

/* kMISExpiredError */
"This provisioning profile has expired." = "Cấu hình cung cấp đã hết hạn.";

/* kMISMalformedProfileError */
"This provisioning profile is malformed." = "Cấu hình cung cấp không hợp lệ.";

/* kMISUnsupportedVersionError */
"This provisioning profile is unsupported." = "Cấu hình cung cấp không được hỗ trợ.";

/* kMISAllocationError */
"Unable to allocate memory." = "Không thể xác định bộ nhớ.";

